//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct SUN
{
	float       x, y;          // 太陽の位置
	float       size;          // サイズ
	float       breathSpeed;   // 呼吸スビート
	float       maxScale;      // 拡大
	float       minScale;      // 縮小
	BOOL        isBreathingIn; // 拡大と縮小判定
	XMFLOAT4    color;
	float       minAlpha;      // 最小透明度
	float       maxAlpha;      // 最大透明度
};

enum frame
{
	first,
	second,

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);


