//=============================================================================
//
// tutorial画面処理 [tutorial.h]
// Author : ヨウシゲン
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct TUTORIAL
{
    XMFLOAT3    pos;        // ポリゴンの座標
    float        w, h;        // 幅と高さ
    int         speed;      //ポイント移動スビート

};

enum
{
    M_TUTORIAL,
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);


